// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 59: Задайте двумерный массив из целых чисел. Напишите программу,
// которая удалит строку и столбец, на пересечении которых расположен наименьший элемент массива.