// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 36. Задайте одномерный массив, заполненный случайными числами. 
// Найдите сумму элементов, стоящих на нечётных позициях.