// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 34. Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество чётных чисел в массиве.
