// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 41: Пользователь вводит с клавиатуры или задает самостоятельно M чисел.
// Посчитайте, сколько чисел больше 0 ввёл пользователь.