// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 43. Напишите программу, которая найдёт точку пересечения двух прямых,
// заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 
// задаются пользователем или задаются вручную.