// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 38. Задайте массив вещественных чисел.
// Найдите разницу между максимальным и минимальным элементов массива.
