// Задача 44. Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
// Фибоначчи – ряд чисел, в котором каждое последующее число является суммой двух предыдущих: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55 и так далее
// System.Console.WriteLine("Введите число ");
// int number = Convert.ToInt32(Console.ReadLine());
// int a = 0;
// int b = 1;
// int result = 0;

// for (int i = 0; i < number - 2 ; i++)
// {
//     if(i==0){
//         System.Console.WriteLine(a);
//         System.Console.WriteLine(b);
//     }
//     result = a+b;
//     a=b;
//     b = result;
//     System.Console.WriteLine(b);
// }