// Задача 39. Напишите программу, которая перевернёт одномерный массив (последний элемент будет на первом месте, а первый - на последнем и т.д.)

void FillArray(int[] col)
{
    for (int i = 0; i < col.Length; i++)
    {
        col[i] = new Random().Next(1, 1000);
    }
}

void PrintArray(int[] col)
{
    for (int i = 0; i < col.Length; i++)
    {
        Console.Write($"{col[i]} ");
    }
}

Console.WriteLine("Введите количество элементов ");
int N = Convert.ToInt32(Console.ReadLine());
int[] mass = new int [N];
int[] mass2 = new int [N];
int j = mass.Length -1;

FillArray(mass);
PrintArray(mass);
Console.WriteLine();

for (int i = 0; i < mass.Length; i++)
{
    mass2[j] = mass[i];
    j--;
}

PrintArray(mass2);


// Задача 40. Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник со сторонами такой длины.

Console.WriteLine("Введите первое число ");
int A = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите второе число ");
int B = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите третье число ");
int C = Convert.ToInt32(Console.ReadLine());

if (A+B > C & A+C > B & B+C > A) Console.WriteLine($"может существовать треугольник со сторонами {A} {B} {C}");
else Console.WriteLine($"не может существовать треугольник со сторонами {A} {B} {C}");