// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");
// Задача 32. Напишите программу замена элементов массива:
// положительные элементы замените на соответствующие отрицательные,
// и наоборот.
